WB/src/Documents/Поставки/Поставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Поставки</name>
  <attributes>
    <name>Продавец</name>
    <type>
      <types>CatalogRef.Продавцы</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдПоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузкиПлановая</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузкиФактическая</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоставки</name>
    <type>
      <types>EnumRef.ТипыПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоштучнаяПалета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

WB/src/Documents/Поставки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗагрузитьВсе() Экспорт
	
	Продавцы = Справочники.Продавцы.ВыбратьВсехПродавцов();
	
	Для Каждого Продавец Из Продавцы Цикл
		ЗагрузитьПоПродавцу(Продавец);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьПоПродавцу(Продавец) Экспорт
	
	НачалоПериода = ПолучитьНачалоПериодаЗагрузки(Продавец);
	Загрузить(Продавец, НачалоПериода);
	
КонецПроцедуры

Процедура Загрузить(Продавец, НачалоПериода, КонецПериода = Неопределено) Экспорт
	
	Если КонецПериода = Неопределено Тогда
		КонецПериода = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Токен = Справочники.Продавцы.ПолучитьТокен(Продавец);
	
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Продавец, Тип("СправочникСсылка.Продавцы"));
	
	ДанныеAPI = ПоставкиAPI.ПолучитьВсеПоставки(Токен, НачалоПериода, КонецПериода);
	
	Если ДанныеAPI = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементAPI Из ДанныеAPI Цикл
		ОбновитьИлиСоздать(ЭлементAPI, Продавец);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ВыбратьДатуПоследнегоДокумента(Продавец) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Поставки.Дата КАК Дата
	|ИЗ
	|	Документ.Поставки КАК Поставки
	|ГДЕ
	|	Поставки.Продавец = &Продавец
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Продавец", Продавец);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Дата;
	
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбновитьИлиСоздать(ДанныеAPI, Продавец)
	
	Объект = Неопределено;
	Ссылка = НайтиПоРеквизиту("ИдЗаказа", ДанныеAPI.ИдЗаказа);
	
	Если Ссылка = Неопределено ИЛИ Ссылка.Пустая() Тогда
		Объект = СоздатьДокумент();
	Иначе
		Объект = Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	Объект.Продавец = Продавец;
	ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI);
	
	Объект.Записать();
	Возврат Объект.Ссылка;
	
КонецФункции

Процедура ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI)
	
	Объект.Дата = ДанныеAPI.ДатаСоздания;
	Объект.Телефон = ДанныеAPI.Телефон;
	Объект.ИдПоставки = ДанныеAPI.ИдПоставки;
	Объект.ИдЗаказа = ДанныеAPI.ИдЗаказа;
	Объект.ДатаОтгрузкиПлановая = ДанныеAPI.ДатаОтгрузкиПлановая;
	Объект.ДатаОтгрузкиФактическая = ДанныеAPI.ДатаОтгрузкиФактическая;
	Объект.ДатаИзменения = ДанныеAPI.ДатаИзменения;
	Объект.Статус = Перечисления.СтатусыПоставки.ПолучитьПоИд(ДанныеAPI.ИдСтатуса);
	Объект.ТипПоставки = Перечисления.ТипыПоставки.ПолучитьПоИд(ДанныеAPI.ИдТипаПоставки);
	
	Если ДанныеAPI.Свойство("ПоштучнаяПалета") Тогда
		Объект.ПоштучнаяПалета = ДанныеAPI.ПоштучнаяПалета;
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьНачалоПериодаЗагрузки(Продавец)
	
	ДатаПоследнегоДокумента = ВыбратьДатуПоследнегоДокумента(Продавец);
	
	Если ДатаПоследнегоДокумента <> Неопределено Тогда
		Возврат ДатаПоследнегоДокумента;
	КонецЕсли;
	
	Возврат Справочники.Продавцы.ПолучитьДатуРегистрации(Продавец);

КонецФункции

#КонецОбласти

#КонецЕсли
